import { PlatformData } from "@/common";

export const PLATFORM: PlatformData[] = [
  {
    id: "backend",
    title: "Backend go developer",
    description:
      "Сейчас мы расширяем штат и ищем опытного Backend-разработчика (Go) (Middle|Senior) для работы над крупным проектом. Тебе предстоит участие в разработке многопользовательского текстового редактора, создание продуктовых фичей и решение сложных технических задач.",
    conditional: [
      "Возможность трудоустройства в аккредитованной ИТ-компании Бишкеке;",
      "Гибкий график, офис в центре Бишкекв, либо возможность удаленной работы на территории Кыргызстана;",
      "Участие в профильных конференциях и курсы повышения квалификации за наш счёт;",
      "Компенсация занятия английским языком;",
      "Performance Review с пересмотром заработной платы два раза в год;",
      "Драйвовый и дружный коллектив, который всегда готов поделиться огромным опытом, и команда, всегда готовая прийти на помощь;",
    ],
    pending: [
      "Не менее 3-х лет коммерческого опыта в backend-разработке на Go (Golang).;",
      "Опыт работы с высоконагруженными системами;",
      "Уверенные владение Python;",
      "Понимание и знание классических алгоритмов и структур данных;",
      "Опыт работы с PostgreSQL;",
      "Опыт использования gRPC;",
      "Навыки работы с Docker (опыт с Kubernetes будет преимуществом);",
      "Опыт работы с GraphQL.",
    ],
  },
  {
    id: "ios",
    title: "IOS developer",
    description:
      "Сейчас мы расширяем наш штат и ищем опытного iOS Developer (Middle|Senior) в команду на крупный проект, где предстоит разработка нового функционала в рамках приложения, правка багов, код-ревью.",
    conditional: [
      "Возможность трудоустройства в аккредитованной ИТ-компании;",
      "Гибкий график, офис в центре Бишкека, либо возможность удаленной работы на территории Кыргызстана;",
      "Участие в профильных конференциях и курсы повышения квалификации за наш счёт;",
      "Компенсация занятия английским языком;",
      "Performance Review с пересмотром заработной платы два раза в год;",
      "Драйвовый и дружный коллектив, который всегда готов поделиться огромным опытом, и команда, всегда готовая прийти на помощь;",
    ],
    pending: [
      "Не менее 3х лет коммерческого опыта в iOS разработке;",
      "Отличное знаете Swift и Objective-С;",
      "Знание системных фреймворков iOS и гайдлайны Apple;",
      "Знание классических алгоритмов и структуры данных;",
      "Опыт работы с паттернами MVP и MVC;",
      "Навыками профилирования.",
    ],
    tasks: [
      "Верстка UI для Android согласно ТЗ;",
      "Оптимизация приложения для работы в Android Auto;",
      "Реализация специфического функционала и обеспечение безопасности для автомобильных приложений.",
    ],
  },
  {
    id: "backend-python",
    title: "Backend python developer",
    description:
      "Сейчас мы расширяем наш штат и ищем опытного Backend-разработчика (Python) (Middle|Middle+) в команду на крупный проект.",
    conditional: [
      "Современный стек, новые технологии, опытная команда;",
      "Возможность трудоустройства в аккредитованной ИТ-компании Бишкек;",
      "Гибкий график, офис в центре Бишкека, либо возможность удаленной работы на территории Кыргызстана;",
      "Performance Review с пересмотром заработной платы два раза в год;",
      "Участие в профильных конференциях и курсы повышения квалификации за наш счёт;",
      "Компенсация за занятия английским языком;",
      "Заботу о здоровье: больничный бюджет, который можно тратить на любые виды лечений и лекарств;",
      "Консультации по личным вопросам со штатным юристом.",
    ],
    pending: [
      "Не менее 3х лет коммерческого опыта в backend-разработке;",
      "Уверенное знание Python и фреймворков для веб-разработки;",
      "Умение и желание писать тесты;",
      "Опыт работы с SQL базами данных (Postgres);",
      "Понимание принципов чистой архитектуры;",
      "Опыт проектирования архитектуры с нуля;",
      "Опыт на React.",
    ],
    tasks: [
      "Разрабатывать новые и поддерживать существующие приложения;",
      "Поддерживать и дорабатывать архитектуру на существующих проектах и предлагать новые решения;",
      "Реализовывать проекты с нуля, закладывать архитектуру и выбирать подходящие технологии;",
      "Проводить Code Review;",
      "Менторить коллег.",
    ],
  },
  {
    id: "qa-engineer",
    title: "QA engineer",
    description:
      "Сейчас мы расширяем штат и ищем опытного QA Engineer (Web) (Middle/Senior) для работы над крупным проектом. Тебе предстоит функциональное тестирование веб-приложений, участие в релизах, обновление тестовой документации, принятие решений по улучшению сервиса с командой и оптимизация тестировочных процессов.",
    conditional: [
      "Возможность трудоустройства в аккредитованной ИТ-компании Бишкека;",
      "Гибкий график, офис в центре Бишкека, либо возможность удаленной работы на территории Кыргызстана;",
      "Участие в профильных конференциях и курсы повышения квалификации за наш счёт;",
      "Компенсация занятия английским языком;",
      "Performance Review с пересмотром заработной платы два раза в год;",
      "Драйвовый и дружный коллектив, который всегда готов поделиться огромным опытом, и команда, всегда готовая прийти на помощь;",
    ],
    pending: [
      "Не менее 3х лет коммерческого опыта ручного тестирования веб-приложений;",
      "Понимание процессов разработки и тестирования;",
      "Владение техниками тест-дизайна и умение их применять;",
      "Работа с инструментами API, такими как Postman и Insomnia;",
      "Использование прокси-инструментов Charles и Proxyman;",
      "Проведение отладки с помощью DevTools.",
    ],
  },
  {
    id: "accountant",
    title: "Backend go developer",
    description:
      "В связи с расширением финансового направления находимся в поисках бухгалтера.",
    conditional: [
      "Возможность трудоустройства в аккредитованной ИТ-компании Бишкека;",
      "Круглосуточный офис в центре города Бишкека, с фруктами и кофемашиной;",
      "Оплачиваемые отпуска и больничные;",
      "Заботу о здоровье: больничный бюджет, который можно тратить на любые виды лечений и лекарств;",
      "Участие в профильных конференциях и курсы повышения квалификации за наш счёт;",
      "Драйвовый и дружный коллектив, который всегда готов поделиться огромным опытом, и команда, всегда готовая прийти на помощь.",
    ],
    pending: [
      "Ведение бухгалтерского, налогового учета в ООО РФ (аккредитованная компания Минцифры), помощь в сборе первичной документации для иностранных юр лиц ГК;",
      "Подготовка и сдача бухгалтерской и налоговой отчетности в контролирующие органы;",
      "Ведение нескольких юр. лиц и ИП (УСН, патент);",
      "Выставление счетов и актов клиентам (отправка по почте, в мессенджерах, по ЭДО);",
      "Оформление авансовых отчетов;",
      "Внесение данных во внутреннюю систему учета;",
      "Базовый кадровый учет;",
      "Расчет, начисление и выплата ЗП;",
      "Ведение бухгалтерии в системе 1С: Предприятие 8.3, использование сервисов Эльба, Диадок.",
    ],
  },
];
